export const weatherCodeMap: Record<number, string> = {
  0: "☀️ Clear",                               // Ясно
  1: "🌤️ Mostly clear",                        // Преимущественно ясно
  2: "⛅ Partly cloudy",                        // Переменная облачность
  3: "☁️ Cloudy",                               // Облачно
  45: "🌫️ Fog",                                 // Туман
  48: "🌫️❄️ Depositing rime fog",              // Иней/дымка
  51: "🌦️ Drizzle: light",                     // Лёгкая морось
  53: "🌦️ Drizzle: moderate",                  // Умеренная морось
  55: "🌧️ Drizzle: dense",                     // Сильная морось
  61: "🌦️ Rain: slight",                        // Небольшой дождь
  63: "🌧️ Rain: moderate",                      // Умеренный дождь
  65: "🌧️ Rain: heavy",                         // Сильный дождь
  71: "🌨️ Snow fall: slight",                  // Небольшой снег
  73: "🌨️ Snow fall: moderate",                // Умеренный снег
  75: "❄️🌨️ Snow fall: heavy",                 // Сильный снег
  80: "🌦️ Rain showers: slight",               // Ливневый дождь
  81: "🌧️ Rain showers: moderate",             // Ливни
  82: "🌧️⛈️ Rain showers: violent",            // Сильные ливни
  95: "⛈️ Thunderstorm: slight or moderate",   // Гроза лёгкая/умеренная
  99: "⛈️🌨️ Thunderstorm: heavy hail"          // Сильная гроза с градом
};